{
  "backend/main.mo": "Actor module handling plan creation, updates, queries, and enquiry submission with access control and blob storage integration.",
  "backend/migration.mo": "Migration module defining old/new actor shapes and initializing an empty plans map during upgrade.",
  "feature_evidence.json": "Feature evidence report listing implemented features, involved files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend components, hooks, utilities, and assets.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining color tokens, theming variables, and base styling for light and dark modes.",
  "frontend/index.html": "HTML entry point with root mount point, meta tags, and script loading the React application.",
  "frontend/src/App.tsx": "Main app component implementing hash-based navigation between the home page and the LIC Plans page with dynamic metadata updates.",
  "frontend/src/components/marketing/About.tsx": "Marketing About section displaying advisor values and a detailed 'Why Choose Me' feature list with icon cards.",
  "frontend/src/components/marketing/Contact.tsx": "Displays the contact section with advisor contact details and embeds the ContactForm component.",
  "frontend/src/components/marketing/ContactForm.tsx": "Implements a validated enquiry form that submits user details using a mutation hook and displays success or error toasts.",
  "frontend/src/components/marketing/FAQ.tsx": "Renders a list of accordion-based FAQs about LIC policies with questions and answers.",
  "frontend/src/components/marketing/Footer.tsx": "Displays the site footer including branding, quick navigation links, contact details, and a disclaimer.",
  "frontend/src/components/marketing/Hero.tsx": "Renders the hero section with a headline, CTAs, trust indicators, and a feature image, with smooth scrolling to sections.",
  "frontend/src/components/marketing/Navbar.tsx": "Provides a responsive navigation bar with scroll-based styling, smooth section navigation, and a mobile menu.",
  "frontend/src/components/marketing/Plans.tsx": "Renders a grid of insurance plan cards with features, popular highlighting, and a scroll-to-contact button.",
  "frontend/src/components/marketing/Services.tsx": "Displays a list of insurance service cards with icons and descriptions plus a visual icon set image.",
  "frontend/src/components/marketing/Testimonials.tsx": "Empty file with no implementation.",
  "frontend/src/hooks/useActor.ts": "Provides a React hook to create and manage an authenticated or anonymous backend actor and invalidate queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook handling identity loading, login, logout, and status tracking via AuthClient.",
  "frontend/src/hooks/usePlans.ts": "Hooks for fetching, creating, and updating plan entries through the backend actor with react-query caching.",
  "frontend/src/hooks/useQueries.ts": "Defines a mutation hook to submit enquiries by mapping form input to backend types and invalidating related queries.",
  "frontend/src/index.css": "Tailwind config defining theme variables, dark mode palette, global styles, and premium table utility classes.",
  "frontend/src/main.tsx": "Entrypoint that mounts the app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/LICPlans.tsx": "Admin-only page to upload plan images, run OCR, create plan metadata, and display existing plans with navigation helpers.",
  "frontend/src/utils/ocr.ts": "Provides simulated OCR processing and parsing of extracted text into structured plan data.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with session persistence support.",
  "frontend/src/utils/validation.ts": "Basic validation helpers for required fields, email format, and optional phone numbers.",
  "frontend/tailwind.config.js": "Tailwind configuration with extended colors, animations, typography, and container settings.",
  "project_state.json": "Metadata describing project requirements, features, and pending requests for the plan upload and OCR system."
}