{
  "backend/main.mo": "Main backend actor implementing plan creation, update, retrieval, enquiry submission, access control, and blob storage integration.",
  "backend/migration.mo": "Migration module that preserves existing userProfiles and plans without structural changes.",
  "feature_evidence.json": "Feature evidence report listing feature requirements, related files, components, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files for documentation or build planning.",
  "frontend/index.css": "Global Tailwind-based styling with OKLCH color tokens, light/dark themes, and base element resets.",
  "frontend/index.html": "HTML entry point defining metadata, title, root container, and script loader for the frontend app.",
  "frontend/src/App.tsx": "Main React app controlling hash-based navigation between the home marketing page and LIC Plans page.",
  "frontend/src/components/marketing/About.tsx": "Marketing About section displaying advisor values, expertise, and a detailed 'Why Choose Me' feature list.",
  "frontend/src/components/marketing/Contact.tsx": "Renders a contact section with static contact details and embeds the ContactForm component.",
  "frontend/src/components/marketing/ContactForm.tsx": "Implements a validated enquiry form with state management and submission via a mutation hook.",
  "frontend/src/components/marketing/FAQ.tsx": "Displays an FAQ section using an accordion to show predefined questions and answers.",
  "frontend/src/components/marketing/Footer.tsx": "Provides the site footer with branding, quick links, contact info, and a disclaimer.",
  "frontend/src/components/marketing/Hero.tsx": "Renders the hero section with headline content, calls-to-action, trust indicators, and a hero image.",
  "frontend/src/components/marketing/Navbar.tsx": "Implements a responsive navigation bar with scroll-based styling, smooth section scrolling, and mobile menu support.",
  "frontend/src/components/marketing/Plans.tsx": "Renders a grid of insurance plan cards with features and a scroll-to-contact button, highlighting the most popular plan.",
  "frontend/src/components/marketing/Services.tsx": "Displays a grid of service cards with icons and descriptions plus a decorative image section.",
  "frontend/src/components/marketing/Testimonials.tsx": "Empty file with no implemented content.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for managing Internet Identity login, stored identities, and authentication state.",
  "frontend/src/hooks/usePlans.ts": "React Query hooks for fetching, creating, and updating insurance plans through the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Defines a mutation hook to submit customer enquiries to the backend and invalidates related queries.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark theme colors, typography, and premium table styling utilities.",
  "frontend/src/main.tsx": "Initializes the app root, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/LICPlans.tsx": "React page handling LIC plan uploads, validation, OCR processing, and admin interactions with plan data.",
  "frontend/src/utils/ocr.ts": "Simulated OCR utilities that extract placeholder text from images and parse it into structured plan data.",
  "frontend/src/utils/planFilenameMatching.ts": "Filename matching utilities that derive plan titles, score candidates, group files, and pick the best match per plan.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL parameters and session-backed persisted values.",
  "frontend/src/utils/validation.ts": "Simple validation helpers for required fields, emails, and phone numbers.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugin usage.",
  "project_state.json": "Tracks project schema, existing features, pending requests, and known build/deploy issues for the LIC Plans image‑assignment workflow. Defines requirements for plan image upload, matching, updating, and deployment error handling."
}