{
  "backend/main.mo": "Main actor defining LIC insurance plan data types (PlanEntry, StructuredPlan, Enquiry, UserProfile, LICPlan) and initializing six hardcoded LIC plans (Jivan Labh, Jivan Umang, Jivan Shanti, Jivan Utsav, Jivan Lakshya, Bima Laxmi) with CRUD operations, authorization mixins, and blob storage integration.",
  "backend/migration.mo": "Migration module that converts old actor state to new schema by adding LICPlan map and #licPlan product interest variant, preserving existing user profiles, plans, and enquiries while initializing the six LIC plan records.",
  "feature_evidence.json": "Feature evidence report documenting implementation of six LIC plans with trilingual support, expandable plan cards, and image mapping across frontend components with high confidence test coverage.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including marketing components, LIC Plans page with trilingual support, React Query hooks, validation utilities, OCR simulation, and responsive styling with premium table utilities.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system using deep forest green and gold palette, plus premium table utilities for responsive plan detail tables with zebra striping and mobile-friendly stacked layout.",
  "frontend/index.html": "HTML entry point with SEO-optimized title and meta description for LIC insurance advisor services.",
  "frontend/src/App.tsx": "Root application component with hash-based routing between home marketing page and dedicated LIC Plans page, wrapped in QueryClientProvider for React Query state management.",
  "frontend/src/components/marketing/About.tsx": "Displays an About section with four value cards (Client-First, Expert Guidance, Personalized Solutions, Long-term Partnership) and a 'Why Choose Me?' section highlighting the advisor's LIC expertise and services.",
  "frontend/src/components/marketing/Contact.tsx": "Renders a Contact section with a three-column layout showing contact information (phone, email, address) and embedding the ContactForm component for user enquiries.",
  "frontend/src/components/marketing/ContactForm.tsx": "Provides a controlled form component for submitting enquiries with validation for name, email, phone, and message fields, using the useSubmitEnquiry hook and displaying toast notifications on success/error.",
  "frontend/src/components/marketing/FAQ.tsx": "Displays an accordion-style FAQ section with six common questions about LIC insurance policies, coverage, claims, tax benefits, and premium payments.",
  "frontend/src/components/marketing/Footer.tsx": "Renders a footer with brand information, quick navigation links, contact details, a disclaimer about LIC authorization, and copyright notice with attribution to Lovable.",
  "frontend/src/components/marketing/Hero.tsx": "Displays the hero section with a headline, CTA buttons for consultation and viewing plans, trust indicators (100% Secure, 500+ Clients, 1 Year Experience), and a hero image.",
  "frontend/src/components/marketing/Navbar.tsx": "Marketing site navigation bar with scroll detection, mobile menu toggle, and smooth scrolling to page sections including home, about, services, plans, LIC plans, FAQ, and contact.",
  "frontend/src/components/marketing/Plans.tsx": "Displays a grid of four popular LIC insurance plan cards (Term, Endowment, ULIP, Pension) with features, descriptions, and a call-to-action button that scrolls to the contact section.",
  "frontend/src/components/marketing/Services.tsx": "Showcases six insurance service categories (Life, Savings, Retirement, Health, Mortgage, Child Education) in a card grid with icons and descriptions.",
  "frontend/src/components/marketing/Testimonials.tsx": "Empty file placeholder for testimonials component.",
  "frontend/src/components/plans/LanguageToggle.tsx": "Language switcher component allowing users to toggle between Marathi, Hindi, and English using translated UI labels.",
  "frontend/src/components/plans/PlanCard.tsx": "Displays an individual LIC plan card with image, name, description, key benefits, and expandable details section with toggle button.",
  "frontend/src/components/plans/PlanDetails.tsx": "Full-page plan details view with back navigation, hero section, plan image with loading states, and multiple content sections (overview, benefits, coverage, premium, returns) with Jivan Utsav fallback support.",
  "frontend/src/components/plans/PlanDetailsExpanded.tsx": "Expanded plan details component showing premium, maturity, and additional information with optional image gallery in a scrollable area, using translated content.",
  "frontend/src/components/plans/PlanPosterImage.tsx": "React component that displays a plan poster image with loading and error states, supporting fallback images and handling ExternalBlob URLs from the backend.",
  "frontend/src/data/planTranslations.ts": "Contains multilingual translations (Marathi, Hindi, English) for LIC plan details including names, descriptions, benefits, premium details, and maturity information for plans like Jivan Labh, Jivan Umang, and Jivan Shanti.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, handling authentication with Internet Identity and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing identity state and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useLanguage.tsx": "React context and hook for managing application language state (Marathi, Hindi, English) with localStorage persistence and a translation helper function.",
  "frontend/src/hooks/useLICPlans.ts": "Custom hooks for fetching LIC plans data using React Query, providing functions to get all plans or a single plan by ID from the backend actor.",
  "frontend/src/hooks/usePlans.ts": "Custom hooks for CRUD operations on plans using React Query, including fetching, creating, updating, and deleting plans with error handling and cache invalidation.",
  "frontend/src/hooks/useQueries.ts": "Custom hook for submitting customer enquiries to the backend, mapping product interest strings to enum values and invalidating the enquiries cache on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette for light/dark themes using forest green and gold colors, plus responsive premium table utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/LICPlans.tsx": "Main page component for displaying LIC insurance plans with language toggle, back navigation, a grid of 6 plan cards, and a CTA section to contact. Wraps content in LanguageProvider for multilingual support.",
  "frontend/src/types/translations.ts": "TypeScript type definitions for multilingual support (Marathi, Hindi, English) including PlanTranslation, UILabels, and TranslatedText interfaces for plan content and UI elements.",
  "frontend/src/utils/jivanUtsavFallback.ts": "Provides fallback content, metadata, and helper functions for the Jivan Utsav plan (Plan No. 771), including title matching logic that handles spelling variants and a canonical poster path.",
  "frontend/src/utils/ocr.ts": "Placeholder OCR implementation that simulates text extraction from plan images and returns structured plan data based on filename pattern matching for various LIC plans.",
  "frontend/src/utils/planFilenameMatching.ts": "Utilities for normalizing filenames and plan titles, deriving plan titles from filenames with spelling variant handling, and scoring/selecting the best file match when multiple uploads map to the same plan.",
  "frontend/src/utils/planImageMapping.ts": "Maps plan IDs to their primary and additional image paths for the 6 LIC plans (Jivan Labh, Umang, Shanti, Utsav, Lakshya, Bima Laxmi) with a default fallback image.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, persisting them in sessionStorage, and clearing sensitive parameters from the URL without page reload.",
  "frontend/src/utils/validation.ts": "Form validation functions for required fields, email format (regex-based), and optional phone numbers (10-15 digits), returning error messages or null if valid.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with CSS variables, container settings, custom border radii, shadows, Inter font family, accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file documenting an LIC insurance plan application with 6 detailed plans, trilingual support (Marathi/Hindi/English), expandable plan cards with premium tables, and mapping to uploaded marketing images; notes previous build failures with image/content display issues."
}