{
  "backend/main.mo": "Main Motoko actor defining LIC insurance plan types (PlanEntry, LICPlan, Enquiry, UserProfile, PremiumRate, MaturityBenefit, RiskCover), initializing sample plans (Jivan Labh, Jivan Umang), and integrating authorization and blob storage mixins with migration support.",
  "backend/migration.mo": "Migration module that transforms OldLICPlan (without structured premium/maturity data) to NewLICPlan (with premiumRates, maturityBenefits, riskCover arrays), preserving user profiles, plans, and enquiries while removing deprecated jivanUtsav fields.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: side-by-side plan comparison view, interactive premium calculator, and maturity benefit calculator, each with associated frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including marketing components (Navbar, Hero, About, Services, Plans, FAQ, Contact, Footer), LIC Plans page with trilingual support, calculators, hooks, utilities, and static assets.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system using deep forest green and gold palette, defining CSS custom properties for light/dark themes and premium table utilities for responsive plan displays.",
  "frontend/index.html": "HTML entry point with SEO-optimized title and meta description for LIC insurance advisor services, loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Root React component with QueryClientProvider, hash-based routing between home (marketing sections), LIC plans, comparison, premium/maturity calculators, and ROI analysis pages, with shared Navbar and Footer.",
  "frontend/src/components/calculators/MaturityCalculatorForm.tsx": "Form component for maturity benefit calculation that collects premium amount, policy term, and entry age with validation (premium ≥₹10k, age 18-65). Supports multilingual labels and error messages.",
  "frontend/src/components/calculators/MaturityResultsDisplay.tsx": "Displays calculated maturity benefits for eligible LIC plans in a grid layout, showing total maturity amount, sum assured, guaranteed additions, and bonuses with currency formatting and multilingual support.",
  "frontend/src/components/calculators/PremiumCalculatorForm.tsx": "Form component for premium calculation that collects age, desired sum assured, and policy term with validation (age 18-65, sum assured ≥₹1L). Includes multilingual labels and error handling.",
  "frontend/src/components/calculators/PremiumResultsGrid.tsx": "Displays calculated premiums for eligible LIC plans in a grid, showing monthly, quarterly, half-yearly, and annual premium amounts with currency formatting and multilingual support.",
  "frontend/src/components/comparison/ComparisonTable.tsx": "Renders a responsive comparison table showing features, descriptions, key benefits, premium details, and sample premiums across multiple LIC plans with multilingual content support.",
  "frontend/src/components/comparison/PlanSelector.tsx": "Checkbox-based plan selector component with select all/clear all functionality, requiring at least 2 plans for comparison. Displays plan names and descriptions with multilingual support.",
  "frontend/src/components/filters/PlanFilterPanel.tsx": "A filter panel component for insurance plans that allows users to filter by age range, monthly budget, and financial goals (savings, pension, money back, guaranteed returns) with multilingual support.",
  "frontend/src/components/marketing/About.tsx": "An about section component showcasing the LIC advisor's values (client-first, expert guidance, personalized solutions, long-term partnership) and qualifications with icon cards and feature lists.",
  "frontend/src/components/marketing/Contact.tsx": "A contact section component displaying contact information (phone, email, office address) alongside an embedded ContactForm component in a two-column layout.",
  "frontend/src/components/marketing/ContactForm.tsx": "A form component for submitting enquiries with fields for name, email, phone, city, product interest, and message, including validation and submission handling via useSubmitEnquiry hook.",
  "frontend/src/components/marketing/FAQ.tsx": "An FAQ section component displaying common questions about LIC insurance policies (term vs endowment, coverage amounts, riders, tax benefits, claims, missed payments) in an accordion layout.",
  "frontend/src/components/marketing/Footer.tsx": "A footer component with branding, quick navigation links, contact information, and a disclaimer about the advisor's relationship with LIC.",
  "frontend/src/components/marketing/Hero.tsx": "Hero section component with headline, CTA buttons, trust indicators (security, clients, experience), and a hero image. Includes smooth scroll navigation to contact and plans sections.",
  "frontend/src/components/marketing/Navbar.tsx": "Fixed navigation bar with logo, desktop/mobile menus, scroll-based styling, and smooth scrolling to sections. Handles navigation to LIC Plans page via hash routing.",
  "frontend/src/components/marketing/Plans.tsx": "Displays four LIC insurance plan cards (Term, Endowment, ULIP, Pension) with features and CTA buttons. Includes a 'Most Popular' badge for Endowment plans.",
  "frontend/src/components/marketing/Services.tsx": "Grid of six service cards (Life Insurance, Savings, Retirement, Health, Mortgage, Child Education) with icons and descriptions, plus a decorative services icon image.",
  "frontend/src/components/marketing/Testimonials.tsx": "Empty testimonials component file with no content.",
  "frontend/src/components/plans/LanguageToggle.tsx": "Language switcher component with buttons for Marathi, Hindi, and English using the useLanguage hook and uiLabels translations.",
  "frontend/src/components/plans/PlanCard.tsx": "Collapsible plan card displaying plan image, name, description, and key benefits. Expands to show PlanDetailsExpanded component with additional images when clicked.",
  "frontend/src/components/plans/PlanDetails.tsx": "Full plan details page with back navigation, hero section, plan image with loading/error handling, and sectioned content (Overview, Benefits, Coverage, Premium, Returns). Includes Jivan Utsav fallback content logic.",
  "frontend/src/components/plans/PlanDetailsExpanded.tsx": "Displays expanded plan details including premium, maturity, and additional information sections with optional image gallery. Uses translations and scroll area for additional images.",
  "frontend/src/components/plans/PlanPosterImage.tsx": "Renders plan poster images with loading states, error handling, and fallback support. Manages image URL retrieval from ExternalBlob and displays appropriate placeholders.",
  "frontend/src/components/roi/ROIComparisonChart.tsx": "Displays a bar chart comparing annual ROI percentages across eligible LIC plans using Recharts. Filters plans by eligibility and sorts by ROI performance.",
  "frontend/src/components/roi/ROIInputForm.tsx": "Form component for collecting premium amount, policy term, and age inputs with validation. Validates minimum premium (₹10,000) and age range (18-65) before triggering ROI calculations.",
  "frontend/src/components/roi/ROIResultsTable.tsx": "Displays detailed ROI analysis in a responsive table showing total premiums, maturity benefits, net gain, and annual ROI for eligible plans. Includes rating badges based on ROI performance.",
  "frontend/src/data/planTranslations.ts": "Contains multilingual translations (Marathi, Hindi, English) for LIC plan details including names, descriptions, benefits, premium details, and maturity information for plans like Jivan Labh, Jivan Umang, and Jivan Shanti.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages backend actor creation with Internet Identity authentication. Handles actor initialization with access control and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useLanguage.tsx": "Provides a React context for multi-language support (English, Hindi, Marathi) with localStorage persistence and a translation helper function.",
  "frontend/src/hooks/useLICPlans.ts": "Exports React Query hooks for fetching all LIC plans and individual plans by ID from the backend actor.",
  "frontend/src/hooks/usePlanFilters.ts": "Custom hook managing filter state (age, budget, goals) for LIC plans with memoized filtering and a clear function.",
  "frontend/src/hooks/usePlans.ts": "Exports React Query hooks for fetching, creating, and updating plan entries with error handling and cache invalidation.",
  "frontend/src/hooks/useQueries.ts": "Provides a mutation hook for submitting customer enquiries with product interest mapping to backend enums.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom color palette (forest green and gold theme), dark mode support, and responsive premium table utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/ComparisonPage.tsx": "Renders a plan comparison page with multi-language support, allowing users to select and compare multiple LIC plans in a table format.",
  "frontend/src/pages/LICPlans.tsx": "Displays a filterable list of LIC plans with navigation to comparison, calculators, and ROI analysis pages, including multi-language support.",
  "frontend/src/pages/MaturityCalculatorPage.tsx": "Page component for the maturity calculator that allows users to input premium, term, and age to calculate maturity benefits across all LIC plans. Includes language toggle, back navigation, and displays results using MaturityResultsDisplay component.",
  "frontend/src/pages/PremiumCalculatorPage.tsx": "Page component for the premium calculator that allows users to input age, sum assured, and term to calculate premium amounts across all LIC plans. Includes language toggle, back navigation, and displays results using PremiumResultsGrid component.",
  "frontend/src/pages/ROIAnalysisPage.tsx": "Page component for ROI analysis that calculates return on investment for LIC plans based on premium, term, and age inputs. Displays results using both ROIComparisonChart and ROIResultsTable components with language support.",
  "frontend/src/types/filters.ts": "TypeScript type definitions for plan filtering, including FinancialGoal type (savings, pension, moneyBack, guaranteedReturns) and PlanFilterCriteria interface with age range, budget range, and financial goals.",
  "frontend/src/types/translations.ts": "TypeScript type definitions for multi-language support (Marathi, Hindi, English) including TranslatedText, PlanTranslation, and comprehensive UILabels interface covering all UI text elements.",
  "frontend/src/utils/jivanUtsavFallback.ts": "Utility providing fallback content and metadata for the Jivan Utsav plan (Plan 771), including canonical title, poster path, plan detection logic, and structured plan content with guaranteed annual income details.",
  "frontend/src/utils/maturityCalculations.ts": "Utility functions for calculating maturity benefits including sum assured, guaranteed additions, bonuses, and net gains. Uses plan-specific multipliers and rates, with fallback estimation when maturity data is unavailable.",
  "frontend/src/utils/ocr.ts": "OCR utility with placeholder implementation that simulates text extraction from plan images and parses extracted text into StructuredPlan format. Includes plan-specific templates for Jivan Utsav, Jivan Umang, Bima Laxmi, and other LIC plans.",
  "frontend/src/utils/planFilenameMatching.ts": "Provides utilities for matching uploaded plan image filenames to plan titles, including normalization, spelling variant handling (Jivan/Jeevan, Laxmi/Lakshmi), scoring algorithms, and selection of best candidate files when multiple files map to the same plan.",
  "frontend/src/utils/planFiltering.ts": "Filters LIC plans by age eligibility, monthly budget ranges, and financial goals (savings, pension, guaranteed returns, money-back), with a main filterPlans function that combines all criteria.",
  "frontend/src/utils/planImageMapping.ts": "Maps plan IDs to primary and additional image paths for displaying plan visuals, with a fallback default image for unmapped plans.",
  "frontend/src/utils/premiumCalculations.ts": "Calculates premium amounts (monthly, quarterly, half-yearly, annual) based on age, sum assured, and term, using plan-specific premium rates when available or fallback estimation, and validates plan eligibility based on age and term constraints.",
  "frontend/src/utils/roiCalculations.ts": "Calculates return on investment for LIC plans including total premiums paid, maturity benefits, net gain, and effective annual ROI using compound interest formulas.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence and functions to clear sensitive parameters from the URL.",
  "frontend/src/utils/validation.ts": "Provides validation functions for required fields, email format (regex-based), and optional phone numbers (10-15 digits after cleaning).",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme with container queries, typography plugin, custom animations (accordion), and Inter font family.",
  "project_state.json": "Project state file defining an LIC insurance plan comparison application with 6 plans (Jivan Labh 736, Jivan Umang, Bima Laxmi 881, Jivan Lakshya, Jivan Utsav, Jivan Shanti 850), trilingual support (Marathi, Hindi, English), and features including side-by-side comparison, premium/maturity calculators, ROI analysis, and search/filter functionality. Contains architectural notes and existing feature definitions with requirement IDs."
}