{
  "backend/main.mo": "Primary backend actor defining plan, enquiry, and user profile types plus create/update plan logic with access control and storage mixins.",
  "backend/migration.mo": "Migration module transferring user profiles and plans from an older actor version while initializing enquiries and counters.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, and test IDs for plan image handling and UI display.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of multiple frontend files for reference or documentation.",
  "frontend/index.css": "Tailwind base and theme variable definitions supporting light/dark mode and custom color tokens.",
  "frontend/index.html": "HTML entry point setting metadata, title, viewport, and mounting the React app.",
  "frontend/src/App.tsx": "Root React app handling hash‑based navigation between home and LIC Plans pages with shared layout components.",
  "frontend/src/components/marketing/About.tsx": "Marketing About section showing advisor values, experience, and reasons to choose their services.",
  "frontend/src/components/marketing/Contact.tsx": "Displays a contact section with advisor contact details and the ContactForm component.",
  "frontend/src/components/marketing/ContactForm.tsx": "Implements a validated enquiry form that submits user details via a mutation hook and shows toast notifications.",
  "frontend/src/components/marketing/FAQ.tsx": "Renders an FAQ section using an accordion with predefined insurance-related questions and answers.",
  "frontend/src/components/marketing/Footer.tsx": "Provides footer branding, quick navigation links, contact info, and an LIC-related disclaimer.",
  "frontend/src/components/marketing/Hero.tsx": "Creates the landing hero section with headline, CTAs, trust indicators, and a main promotional image.",
  "frontend/src/components/marketing/Navbar.tsx": "Implements a responsive navigation bar with scroll-to-section behavior and mobile menu handling.",
  "frontend/src/components/marketing/Plans.tsx": "Renders a grid of predefined insurance plans with features and a scroll-to-contact button, highlighting the most popular plan.",
  "frontend/src/components/marketing/Services.tsx": "Displays a list of insurance-related services with icons and descriptions, along with a supporting image section.",
  "frontend/src/components/marketing/Testimonials.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/plans/PlanPosterImage.tsx": "Component that loads and displays a plan poster image with loading and error fallbacks.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor instance based on user identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login flow, stored identities, and status flags.",
  "frontend/src/hooks/usePlans.ts": "Contains hooks for fetching, creating, and updating plans via the backend actor, with error handling and cache invalidation.",
  "frontend/src/hooks/useQueries.ts": "Provides a mutation hook to submit user enquiries to the backend and invalidates related queries on success.",
  "frontend/src/index.css": "Defines Tailwind layers, CSS variables for light/dark themes, and responsive utility styles including premium table formatting.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/LICPlans.tsx": "Implements the LIC plans management page with admin actions, file uploads, OCR processing, and plan display controls.",
  "frontend/src/utils/ocr.ts": "Provides a simulated OCR pipeline with progress reporting and basic plan text parsing logic.",
  "frontend/src/utils/planFilenameMatching.ts": "Handles filename normalization, plan title derivation, and scoring/grouping logic for matching uploaded files to plans.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for extracting, persisting, and clearing URL and session parameters.",
  "frontend/src/utils/validation.ts": "Contains simple validation functions for required fields, email, and phone formats.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, shadows, animations, and plugins such as typography, container queries, and animate.",
  "project_state.json": "Project state metadata describing features and requirements for attaching and displaying poster images for LIC plans, starting with Jeevan Utsav."
}