{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "LIC Plans: map uploaded Jeevan Utsav poster and render plan poster images",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Improve upload filename-to-plan-title mapping so \"jivan utsav-6.jpg\" is grouped under \"Jeevan Utsav\" and shown as the selected/best candidate in the upload summary.",
      "acceptanceCriteria": [
        "When selecting the file named \"jivan utsav-6.jpg\" in the LIC Plans upload input, the UI groups it under the derived plan title \"Jeevan Utsav\".",
        "The upload summary indicates the selected/best candidate for \"Jeevan Utsav\" is \"jivan utsav-6.jpg\" (when it is the only file for that plan title)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/planFilenameMatching.ts",
          "operation": "modify",
          "description": "Harden plan title derivation for \"Jeevan Utsav\" by covering common spelling/typo variants (e.g., jivan/jeevan and potential \"utasav\" typo) and add a small exported title-normalization helper suitable for comparing existing plan titles to derived titles."
        },
        {
          "path": "frontend/src/pages/LICPlans.tsx",
          "operation": "modify",
          "description": "Update the pending-upload grouping and summary rendering so each derived plan title always shows the chosen/best candidate filename (even when only one file is present), ensuring \"Jeevan Utsav\" displays \"jivan utsav-6.jpg\" as the selected file."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure Upload & Process creates or updates the \"Jeevan Utsav\" plan with the uploaded poster and OCR-simulated structured content, updating an existing plan even if its title uses a Jivan/Jeevan spelling variant.",
      "acceptanceCriteria": [
        "Running Upload & Process with only \"jivan utsav-6.jpg\" results in a plan titled \"Jeevan Utsav\" appearing in the fetched plans list (created if missing, updated if already exists).",
        "The created/updated plan includes a non-empty poster blob and non-empty structured content fields (at minimum, the \"Overview\" section has text).",
        "No unauthorized errors occur for an authenticated admin user; if not authenticated as admin, the upload UI remains inaccessible as it is today."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LICPlans.tsx",
          "operation": "modify",
          "description": "Adjust existing-plan detection during upload processing to use a normalized title comparison (e.g., treating \"Jivan Utsav\" and \"Jeevan Utsav\" as the same logical plan) so the workflow updates the correct plan when present, while continuing to use the existing OCR simulation and plan save flow."
        },
        {
          "path": "frontend/src/utils/planFilenameMatching.ts",
          "operation": "modify",
          "description": "Expose and reuse a consistent normalization function for plan titles (for both derived titles and stored titles) so the upload workflow can reliably match and update existing plans despite Jivan/Jeevan spelling variations."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Render each plan’s stored poster blob as an image in LIC Plans list cards and expanded/detail view, with sensible sizing and a robust fallback placeholder if rendering fails.",
      "acceptanceCriteria": [
        "For the \"Jeevan Utsav\" plan created/updated from \"jivan utsav-6.jpg\", the plan list shows the poster image thumbnail on the plan card.",
        "When expanding a plan, the poster image is also visible in the expanded/detail view.",
        "If an image cannot be rendered for any reason, the UI shows a clear fallback (e.g., placeholder area/icon) without breaking the page layout."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/plans/PlanPosterImage.tsx",
          "operation": "create",
          "description": "Create a reusable poster renderer that accepts a plan poster blob and displays it using the blob-storage ExternalBlob direct URL capability (use ExternalBlob.getDirectURL()), includes loading/error handling, and shows a clear placeholder fallback when unavailable or when image loading fails. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/LICPlans.tsx",
          "operation": "modify",
          "description": "Use the new PlanPosterImage component in the plans grid card UI and the expanded/detail view so each plan shows a consistent poster thumbnail/preview with proper sizing/aspect handling and a fallback placeholder. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}